#include <print>
#include <string>

#include "check_cin.h"
#include "task_1.h"
#include "run_tasks.h"
#include "task_2.h"
#include "task_3.h"
#include "task_4.h"
#include "task_5.h"

void menu();

int main(int argc, char **argv) {
    menu();
}

void menu() {
    bool exit = false;

    while (!exit) {
        std::println(" 0 -> Выход\n n -> Запуск n задания (1-5)");

        int choice = io::input_value<int>("Введите пункт меню", "Неверный пункт меню", true, 0, 5);
        const std::string compl_by = "\nВыполнил Финевич Арсений\nВариант 12";
        const std::vector<std::string> essence = {
            "Сформировать два двумерных динамических массива-матрицы A и B размерностью 𝑛 × 𝑘. Размерность массивов ввести с клавиатуры",
            "Для заданного одномерного массива X из N элементов найти сумму выражений, вычисляемых по формуле Xi^2, {1, 2, 3, 4, 5, 6}",
            "Создать динамический массив из элементов, расположенных на главной диагонали матрицы и имеющих четное значение. Вычислить произведение элементов динамического массива",
            "Создать двумерный динамический массив вещественных чисел. Определить, встречаются ли среди них элементы с нулевым значением.",
            "Дан двумерный динамический массив целых чисел. Значения элементов данного массива ввести с клавиатуры. Создать динамический массив из элементов, расположенных в четных столбцах данного массива и имеющих нечетное значение"
        };

        void (*tasks_list[5]) () = {
            task_1::do_task_1,
            task_2::do_task_2,
            task_3::do_task_3,
            task_4::do_task_4,
            task_5::do_task_5
        };

        switch (choice) {
            case 0:
                exit = true;
                break;
            default:
                tasks::run_task(choice, tasks_list, essence, compl_by);
        }
    }
}
